{
    "quotes":[
    {"date": "3/17/21","quote":"People who work the hardest, are always the people who are misunderstood."},
    {"date": "3/18/21", "quote": "When WORDS have power at the RIGHT time & hour IMAGIANATION rules & DREAMS come true."},
    {"date": "3/19/21", "quote": "Your future is created by what you do TODAY not TOMORROW."},
    {"date": "3/22/21", "quote": "Never let the things you WANT make you forget the things you HAVE"},
    {"date": "3/23/21", "quote": "Let your dreams be bigger than your fears & your actions louder than your words."},
    {"date": "3/24/21", "quote": "You are braver than you believe,stronger than you seem, and smarter than you think."},
    {"data": "3/24/21", "quote": "Never let your FEAR decide your FUTURE."},
    {"date": "3/25/21", "quote": "Don't be afraid of who you are, be afraid of what you become."},
    {"date": "4/6/21", "quote": "Making mistakes is better than faking perfection."},
    {"date": "4/7/21", "quote": "What hurts you today will make you stronger tomorrow."},
    {"date": "4/8/21", "quote": "Without fear there cannot be courage."},
    {"date": "4/9/21", "quote": "If you get tired, learn to rest not to quit."},
    {"date": "4/12/21", "quote": "Time you enjoy wasting is not Time Wasted  time."},
    {"date": "4/13/21", "quote": "Mistakes are proof that you are trying."},
    {"date": "4/14/21", "quote": "In the end, you only regret the chances you didn't take."},
    {"date": "4/15/21", "quote": "People who can't handle your silence, will never understand your words."},
    {"date": "4/16/21", "quote": "Once you become fearless, life becomes limitless."},
    {"date": "4/19/21", "quote": "Let your dreams be bigger than your fears & your actions be louder than your words."},
    {"date": "4/20/21", "quote": "There is no fun in perfection. I guess that means we should all stop trying to be perfect."},
    {"date": "4/21/21", "quote": "Don't care what others think, nobody's perfect."},
    {"date": "4/22/21", "quote": "A Life that lives off 'perfection' is no life at all."},
    {"date": "4/23/21", "quote": "Making mistakes shows that you're learning. mistakes are what help us learn."},
    {"date": "4/26/21", "quote": "Not every day is gonna be a happy day & that’s okay."},
    {"date": "4/27/21", "quote": "Even in your darkest times, you can have the happiest moments."},
    {"date": "5/3/21", "quote": "Never stop learning because Life never stops teaching."},
    {"date": "5/4/21", "quote": "Life is like a book, therefore you cannot walk out of your own story. Remember that."},
    {"date": "5/5/21", "quote": "In the end we only regret the chances we didn’t take."},
    {"date": "5/6/21", "quote": "Be a voice not an Echo."},
    {"date": "5/7/21", "quote": "If you can dream it, you can achieve it."},
    {"date": "5/10/21", "quote": "Life is not always going to be easy, but that doesn’t mean you should give up."},
    {"date": "5/11/21", "quote": "Life will throw obstacles at you and sometimes they can take you down, but it is you who decides if you stay down."},
    {"date": "5/12/21", "quote": "Life is a challenge, challenges are like a game. But they're not over when you lose, they are over when you quit."},
    {"date": "5/13/21", "quote": "School teaches you a lesson, then gives you a test. But Life gives you a test, then teaches you a lesson."},
    {"date": "5/14/21", "quote": "Take the risk or lose the chance. You never know unless you try  Quote of the day: You can try and not succeed and try again. Or you can quit but miss your chance. The choice is yours, no one can make that choice but you."},
    {"date": "5/17/21", "quote": "We face many defeats, But we are not yet defeated."},
    {"date": "5/18/21", "quote": "The world is a book and those who do not travel only read a page."},
    {"date": "5/19/21", "quote": "Silence speaks, when words can't."},
    {"date": "5/27/21", "quote": "LIFE teaches us to make good use of time, While TIME teaches us the value  of life."},
    {"date": "5/28/21", "quote": "Everyone has a story, don’t be afraid to tell yours."}
    ]
}